IDEA StatiCa Open Model
ReinfAroundOpening.DiagonalReinforcement Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Add diagonal reinforcement
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public bool DiagonalReinforcement { get; set; }
Public Property DiagonalReinforcement As Boolean
	Get
	Set
public:
property bool DiagonalReinforcement {
	bool get ();
	void set (bool value);
}
Property Value
Type: Boolean
See Also
Reference
ReinfAroundOpening Class
IdeaRS.OpenModel.Detail Namespace